EmilZander/Bushaltestelle-ESP8266/Firmware/src/main.cpp
#pragma region Variables

#pragma region Globals
LiquidCrystal_I2C lcd(0x27, 16, 2); // The LCD-display
ESP8266WebServer server(80); // The webserver to be hosted
#pragma endregion

static const uint16_t WIFI_MAGIC = 0xA5A5;
static const uint16_t API_MAGIC = 0xB5B5;
static const int EEPROM_SIZE_BYTES = 1024;  // Vergrößert für API-Clients
static const int EEPROM_WIFI_ADDR = 0;
static const int EEPROM_API_ADDR = 256;     // API-Clients Start nach WiFi-Daten

// EEPROM-backed storage for WiFi credentials
struct WifiCreds {
  uint16_t magic;
  char ssid[33];      // 32 chars + null
  char password[65];  // 64 chars + null
};

struct APIclient
{
  int id;
  char name[17];      // 16 chars + null
  char apiKey[17];  // 16 chars + null
  bool enabled;      // 0 = disabled, 1 = enabled
};

const APIclient EMPTY_CLIENT = { -1, "", "", false };

class APIclientList
{
  public:
    static const int MAX_CLIENTS = 8;
  private:
    static APIclient clients[MAX_CLIENTS];
    static int clientCount;
  
  public:
    static const APIclient* clients_get()
    {
      return APIclientList::clients;
    }
  
    static int clientCount_get()
  {
    for (int i = 0; i < MAX_CLIENTS; i++)
    {
      if (clients[i].id == -1)
      {
        APIclientList::clientCount= i;
        break;
      }
    }
    
      return APIclientList::clientCount;
    }    
    
    static APIclient clients_getByID(const int id)
    {
      if (id == -1)
      {
        return EMPTY_CLIENT;
      }

      if (APIclientList::clientCount_get() == 0)
      {
        return EMPTY_CLIENT;
      }

      for (int i = 0; i < APIclientList::clientCount_get(); i++)
      {
        if (APIclientList::clients[i].id == id)
        {
          return APIclientList::clients[i];
        }
      }
      return EMPTY_CLIENT;
    }
    
    static bool clients_add(const APIclient& client)
    {
      if (APIclientList::clientCount >= MAX_CLIENTS)
      {
        return false; // List full
      }
      
      APIclientList::clients[APIclientList::clientCount] = client;
      APIclientList::clientCount++;

      return true;
    }
    
    static bool clients_add(const char* name, const char* apiKey)
    {
      APIclient client;
      client.id = APIclientList::getNextID();
      strncpy(client.name, name, sizeof(client.name)-1);
      strncpy(client.apiKey, apiKey, sizeof(client.apiKey)-1);
      return clients_add(client);
    }
    
    static void clients_clear()
    {
      APIclientList::clientCount = 0;
      memset(clients, 0, sizeof(clients));
    }
    
    static void clients_removeByID(int id)
    {
      for (int i = 0; i < APIclientList::clientCount; i++)
      {
        if (clients[i].id == id)
        {
          // Shift remaining APIclientList::clients down
          for (int j = i; j < APIclientList::clientCount - 1; j++)
          {
            APIclientList::clients[j] = APIclientList::clients[j + 1];
          }
          APIclientList::clientCount--;
          break;
        }
      }
      
    }
    
    static int getNextID()
    {
      int i = 1;
      while (i < 100)
      {
        if (clients_getByID(i).id == -1)
        {
          return i;
        }
        i++;
      }
      
      return -1;
    }
    
    static void clients_setByID(int id, const char* name, const char* apiKey)
    {
      for (int i = 0; i < APIclientList::clientCount; i++)
      {
        if (clients[i].id == id)
        {
          strncpy(clients[i].name, name, sizeof(clients[i].name)-1);
          strncpy(clients[i].apiKey, apiKey, sizeof(clients[i].apiKey)-1);
          break;
        }
      }
    }
    
    static APIclient clients_getByName(char* name)
    {
      for (int i = 0; i < APIclientList::clientCount; i++)
      {
        if (strcmp(APIclientList::clients[i].name, name) == 0)
        {
          return APIclientList::clients[i];
        }
      }
      return EMPTY_CLIENT;
    }

    static String getNextName()
    {
      int i = 1;
      while (true)
      {
        if (APIclientList::clients_getByName((char*)("Client" + String(i)).c_str()).id == -1)
        {
          return ("Client"+String(i)).c_str();
        }
        i++;
      }
    }
    
    // Speichert die API-Clients im EEPROM
    bool saveToEEPROM() {
      struct APIClientHeader {
        uint16_t magic;
        uint8_t count;
      } header;
      
      header.magic = API_MAGIC;
      header.count = clientCount;
      
      EEPROM.begin(EEPROM_SIZE_BYTES);
      
      // Header schreiben
      EEPROM.put(EEPROM_API_ADDR, header);
      
      // Clients schreiben
      int offset = EEPROM_API_ADDR + sizeof(header);
      for (int i = 0; i < clientCount; i++) {
        EEPROM.put(offset, APIclientList::clients[i]);
        offset += sizeof(APIclient);
      }
      
      bool success = EEPROM.commit();
      EEPROM.end();
      return success;
    }
    
    // Lädt die API-Clients aus dem EEPROM
    bool fetchFromEEPROM() {
      struct APIClientHeader {
        uint16_t magic;
        uint8_t count;
      } header;
      
      EEPROM.begin(EEPROM_SIZE_BYTES);
      
      // Header lesen
      EEPROM.get(EEPROM_API_ADDR, header);
      
      // Prüfen ob valide Daten
      if (header.magic != API_MAGIC || header.count > MAX_CLIENTS) {
        // Keine oder ungültige Daten -> Liste leeren
        clients_clear();
        EEPROM.end();
        return false;
      }
      
      // Clients lesen
      clientCount = header.count;
      int offset = EEPROM_API_ADDR + sizeof(header);
      for (int i = 0; i < clientCount; i++) {
        EEPROM.get(offset, APIclientList::clients[i]);
        offset += sizeof(APIclient);
      }
      
      EEPROM.end();
      return true;
    }
    
    static String generateApiKey() {
      const char charset[] = "ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789";
      const size_t keyLength = 16;
      String apiKey;
      apiKey.reserve(keyLength);
      
      for (size_t i = 0; i < keyLength; i++) {
        apiKey += charset[random(0, sizeof(charset) - 1)];
      }
      return apiKey;
    }

